<details><summary>Digger run report at 2023-08-02 08:26:14 (UTC)</summary>
      <details><summary>Locking successful</summary>
  Project diggerhq/drift-detection-demo#prod-sg has been locked by PR #11
</details>

<details><summary>Plan for <b>diggerhq/drift-detection-demo#prod-sg</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_instance.example_server will be created
  + resource "aws_instance" "example_server" {
      + ami                                  = "ami-04e914639d0cca79a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.allow_tls will be updated in-place
  ~ resource "aws_security_group" "allow_tls" {
        id                     = "sg-0ddd2117b3db284f4"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        name                   = "allow_tls_prod"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # null_resource.test001 will be destroyed
  # (because null_resource.test001 is not in configuration)
  - resource "null_resource" "test001" {
      - id = "5537798096011448516" -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (prod-sg)</summary>
  Terraform plan failed validation checks :x:<br>    Only t2.micro EC2 instances are allowed%!(EXTRA string=aws_instance.example_server)
</details>

</details>